<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple Computer//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Comment</key>
  <string>Created by Joshua Smith on 07/08/2020.</string>
  <key>Description</key>
  <string>Downloads the latest version of iShowU Instant and creates a package.</string>
  <key>Identifier</key>
  <string>com.github.cranappras.pkg.iShowUInstant</string>
  <key>Input</key>
  <dict>
    <key>NAME</key>
    <string>iShowUInstant</string>
    <key>BUNDLE_ID</key>
    <string>iShowUInstant</string>
  </dict>
  <key>MinimumVersion</key>
  <string>1.0.0</string>
  <key>ParentRecipe</key>
  <string>com.github.andrewvalentine.download.ishowuinstant</string>
  <key>Process</key>
  <array>
    <dict>
      <key>Processor</key>
      <string>AppPkgCreator</string>
      <key>Arguments</key>
      <dict>
        <key>bundleid</key>
        <string>com.shinywhitebox.iShowU-Instant</string>
      </dict>
    </dict>
  </array>
</dict>
</plist>
