<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.1.2 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Brave.</string>
	<key>Identifier</key>
	<string>com.github.cranappras.download.Brave</string>
	<key>Input</key>
	<dict>
		<key>APP_FILENAME</key>
		<string>Brave Browser</string>
		<key>NAME</key>
		<string>Brave</string>
		<key>SPARKLE_FEED_URL</key>
		<string>https://updates.bravesoftware.com/sparkle/Brave-Browser/stable/appcast.xml</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>appcast_url</key>
				<string>%SPARKLE_FEED_URL%</string>
			</dict>
			<key>Processor</key>
			<string>SparkleUpdateInfoProvider</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%version%.dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Brave Browser.app</string>
				<key>requirement</key>
				<string>(identifier "com.brave.Browser" or identifier "com.brave.Browser.beta" or identifier "com.brave.Browser.dev" or identifier "com.brave.Browser.nightly") and certificate leaf = H"392f0ba65b348b1fa2fa028aa11752a01b8481a5"</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
