<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created by Joshua Smith (Cranaprpas) on 05/05/2020</string>
	<key>Description</key>
	<string>Downloads the latest version of PyCharm Professional Edition and creates a package.</string>
	<key>Identifier</key>
	<string>com.github.cranappras.pkg.PyCharm-PE</string>
	<key>Input</key>
	<dict>
		<key>APP_FILENAME</key>
		<string>PyCharm</string>
		<key>BUNDLE_ID</key>
		<string>com.jetbrains.pycharm</string>
		<key>NAME</key>
		<string>PyCharm Professional Edition</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.bnpl.autopkg.download.pycharmpe</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
