<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Comment</key>
  <string>Created by Joshua Smith - 01/28/2020</string>
  <key>Description</key>
  <string>Downloads the latest OpenVPN Connect V2 disk image.</string>
  <key>Identifier</key>
  <string>com.github.cranappras.download.OpenVPNConnectV2</string>
  <key>Input</key>
  <dict>
    <key>DOWNLOAD_URL</key>
    <string>https://openvpn.net/downloads/openvpn-connect-v2-macos.dmg</string>
    <key>NAME</key>
    <string>OpenVPNConnectV2</string>
  </dict>
  <key>MinimumVersion</key>
  <string>1.0</string>
  <key>Process</key>
  <array>
    <dict>
      <key>Arguments</key>
      <dict>
        <key>filename</key>
        <string>%NAME%.dmg</string>
        <key>url</key>
        <string>%DOWNLOAD_URL%</string>
      </dict>
      <key>Processor</key>
      <string>URLDownloader</string>
    </dict>
    <dict>
      <key>Processor</key>
      <string>EndOfCheckPhase</string>
    </dict>
    <dict>
      <key>Arguments</key>
      <dict>
        <key>expected_authority_names</key>
        <array>
          <string>Developer ID Installer: OPENVPN TECHNOLOGIES, INC. (ACV7L3WCD8)</string>
          <string>Developer ID Certification Authority</string>
          <string>Apple Root CA</string>
        </array>
        <key>input_path</key>
        <string>%pathname%/OpenVPN_Connect_Installer_signed.pkg</string>
      </dict>
      <key>Processor</key>
      <string>CodeSignatureVerifier</string>
    </dict>
  </array>
</dict>
</plist>
