<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.1.2 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of KeePassX.</string>
	<key>Identifier</key>
	<string>com.github.cranappras.download.KeePassX</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>KeePassX</string>
		<key>SEARCH_URL</key>
		<string>https://www.keepassx.org/downloads</string>
		<key>SEARCH_PATTERN</key>
		<string>(\/releases\/([0-9]{1,2}.){1,3}KeePassX-([0-9]{1,2}.){1,3}dmg)</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
				<key>Arguments</key>
				<dict>
						<key>url</key>
						<string>%SEARCH_URL%</string>
						<key>re_pattern</key>
						<string>%SEARCH_PATTERN%</string>
				</dict>
				<key>Processor</key>
				<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>url</key>
				<string>%url%%match%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
