<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple Computer//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Comment</key>
  <string>Created by Joshua Smith on 09/03/2020</string>
  <key>Description</key>
  <string>Downloads the latest version of Querious.</string>
  <key>Identifier</key>
  <string>com.github.cranappras.download.Querious</string>
  <key>Input</key>
  <dict>
    <key>DOWNLOAD_URL</key>
    <string>https://www.araelium.com/querious/downloads/Querious.dmg</string>
    <key>NAME</key>
    <string>Querious</string>
  </dict>
  <key>MinimumVersion</key>
  <string>1.0.0</string>
  <key>Process</key>
  <array>
    <dict>
      <key>Arguments</key>
      <dict>
        <key>filename</key>
        <string>%NAME%.dmg</string>
        <key>url</key>
        <string>%DOWNLOAD_URL%</string>
      </dict>
      <key>Processor</key>
      <string>URLDownloader</string>
    </dict>
    <dict>
      <key>Processor</key>
      <string>EndOfCheckPhase</string>
    </dict>
    <dict>
      <key>Arguments</key>
      <dict>
        <key>input_path</key>
        <string>%pathname%/Querious.app</string>
        <key>requirement</key>
        <string>anchor apple generic and identifier "com.araeliumgroup.querious" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "28488A87JB")</string>
      </dict>
      <key>Processor</key>
      <string>CodeSignatureVerifier</string>
    </dict>
    <dict>
      <key>Arguments</key>
      <dict>
        <key>input_plist_path</key>
        <string>%pathname%/Querious.app/Contents/Info.plist</string>
        <key>plist_version_key</key>
        <string>CFBundleShortVersionString</string>
      </dict>
      <key>Processor</key>
      <string>Versioner</string>
    </dict>
  </array>
</dict>
</plist>
