<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple Computer//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Comment</key>
  <string>Created by Joshua Smith on 09/03/2020.</string>
  <key>Description</key>
  <string>Downloads, packages, and imports the latest release of Querious in to Jamf Pro.</string>
  <key>Identifier</key>
  <string>com.github.jss-recipes.jss.Querious</string>
  <key>Input</key>
  <dict>
    <key>CATEGORY</key>
    <string>Database</string>
    <key>GROUP_NAME</key>
    <string>%NAME%-update-smart</string>
    <key>GROUP_TEMPLATE</key>
    <string>SmartGroupTemplate</string>
    <key>NAME</key>
    <string>Querious</string>
    <key>POLICY_CATEGORY</key>
    <string>Testing</string>
    <key>POLICY_TEMPLATE</key>
    <string>PolicyTemplate.xml</string>
    <key>SELF_SERVICE_DESCRIPTION</key>
    <string>View, search, edit, import, export, build, configure, and monitor your MySQL and compatible databases easier than ever before.</string>
    <key>SELF_SERVICE_ICON</key>
    <string>%NAME%.png</string>
  </dict>
  <key>MinimumVersion</key>
  <string>1.0.0</string>
  <key>ParentRecipe</key>
  <string>com.github.cranappras.pkg.Querious</string>
  <key>Process</key>
  <array>
    <dict>
      <key>Arguments</key>
      <dict>
        <key>category</key>
        <string>%CATEGORY%</string>
        <key>groups</key>
        <array>
          <dict>
            <key>name</key>
            <string>%GROUP_NAME%</string>
            <key>smart</key>
            <true/>
            <key>template_path</key>
            <string>%GROUP_TEMPLATE%</string>
          </dict>
        </array>
        <key>policy_category</key>
        <string>%POLICY_CATEGORY%</string>
        <key>policy_template</key>
        <string>%POLICY_TEMPLATE%</string>
        <key>prod_name</key>
        <string>%NAME%</string>
        <key>self_service_description</key>
        <string>%SELF_SERVICE_DESCRIPTION%</string>
        <key>self_service_icon</key>
        <string>%SELF_SERVICE_ICON%</string>
        <key>pkg_path</key>
        <string>%pkg_path%</string>
      </dict>
      <key>Processor</key>
      <string>JSSImporter</string>
    </dict>
  </array>
</dict>
</plist>
