<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple Computer//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Comment</key>
  <string>Created by Joshua Smith on 09/03/2020.</string>
  <key>Description</key>
  <string>Downloads and packages the latest release of Querious.</string>
  <key>Identifier</key>
  <string>com.github.cranappras.pkg.Querious</string>
  <key>Input</key>
  <dict>
    <key>BUNDLE_ID</key>
    <string>com.araeliumgroup.querious</string>
    <key>NAME</key>
    <string>Querious</string>
  </dict>
  <key>MinimumVersion</key>
  <string>1.0.0</string>
  <key>ParentRecipe</key>
  <string>com.github.cranappras.download.Querious</string>
  <key>Process</key>
  <array>
    <dict>
      <key>Arguments</key>
      <dict>
        <key>app_path</key>
        <string>%pathname%/Querious.app</string>
      </dict>
      <key>Processor</key>
      <string>AppPkgCreator</string>
    </dict>
  </array>
</dict>
</plist>
